# Analysis of Chicago Public School Level Performance Data-Set Using SQL and Python


## Objectives

After completing this lab you will be able to:

-   Understand the dataset for Chicago Public School level performance
-   Store the dataset in MySQL database on local server
-   Retrieve metadata about tables and columns and query data from mixed case columns
-   Solve example problems to practice your SQL skills including using built-in database functions

## Chicago Public Schools - Progress Report Cards (2011-2012)

The city of Chicago released a dataset showing all school level performance data used to create School Report Cards for the 2011-2012 school year. The dataset is available from the Chicago Data Portal: [https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t](https://data.cityofchicago.org/Education/Chicago-Public-Schools-Progress-Report-Cards-2011-/9xs2-f89t?cm_mmc=Email_Newsletter-_-Developer_Ed%2BTech-_-WW_WW-_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ&cm_mmc=Email_Newsletter-_-Developer_Ed%2BTech-_-WW_WW-_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

This dataset includes a large number of metrics. Start by familiarizing yourself with the types of metrics in the database: [https://data.cityofchicago.org/api/assets/AAD41A13-BE8A-4E67-B1F5-86E711E09D5F?download=true](https://data.cityofchicago.org/api/assets/AAD41A13-BE8A-4E67-B1F5-86E711E09D5F?download=true&cm_mmc=Email_Newsletter-_-Developer_Ed%2BTech-_-WW_WW-_-SkillsNetwork-Courses-IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork-20127838&cm_mmca1=000026UJ&cm_mmca2=10006555&cm_mmca3=M12345678&cvosrc=email.Newsletter.M12345678&cvo_campaign=000026UJ)

**NOTE**: 

Do not download the dataset directly from City of Chicago portal. Instead download a static copy which is a more database friendly version from this <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_edX/data/Chicago_Public_Schools_-_Progress_Report_Cards__2011-2012-v3.csv">link</a>.

Now review some of its contents.

### Store the dataset in a Table

In many cases the dataset to be analyzed is available as a .CSV (comma separated values) file, perhaps on the internet. To analyze the data using SQL, it first needs to be stored in the database.

While it is easier to read the dataset into a Pandas dataframe and then `--persit` it into the database as we saw in the previous lab, it results in mapping to default datatypes which may not be optimal for SQL querying. For example a long textual field may map to a CLOB instead of a VARCHAR. 

Therefore, **it is highly recommended to manually load the table using MySQL `Table Data Import Wizard`**.

##### Now open MySQL Workbench, right click on your Schema and click on `Table Data Import Wizard`. Choose the path for the csv file and click next. Select `Create New Table`, rename table as **SCHOOLS** and ensure `Drop Table if exist` is marked. Click next and next to import the data from the csv file. Please pay attention to the error report and ensure the import result is error free.

### Connect to the database

Let us now load the ipython-sql  extension and establish a connection with the database

In [1]:
%load_ext sql

In [2]:
# Enter the connection string for your MySQL database below

import os 

from dotenv import load_dotenv
load_dotenv() 

myuser = os.environ.get('mysql_username')      # e.g. 'root'
mypassword= os.environ.get('mysql_password')   # e.g. 'sample-password' 

connection_url = 'mysql://{user}:{password}@localhost/ibm_sql_lab'.format(user=myuser,password=mypassword)

%sql {connection_url}

### Query the database system catalog to retrieve table metadata

##### You can verify that the table creation was successful by retrieving the list of all tables in your schema and checking whether the SCHOOLS table was created

In [3]:
%%sql 

show full tables;

 * mysql://root:***@localhost/ibm_sql_lab
5 rows affected.

[('chicago_socioeconomic_data', 'BASE TABLE'),
 ('instructor', 'BASE TABLE'),
 ('international_student_test_scores', 'BASE TABLE'),
 ('petsale', 'BASE TABLE'),
 ('schools', 'BASE TABLE')]

### Query the database system catalog to retrieve column metadata

##### The SCHOOLS table contains a large number of columns. How many columns does this table have?

In [4]:
%%sql 

select count(*) as 'TOTAL_NUMBER_OF_COLUMNS' 
    from INFORMATION_SCHEMA.COLUMNS       
    where table_name = 'SCHOOLS';

 * mysql://root:***@localhost/ibm_sql_lab
1 rows affected.

[(78,)]

Now retrieve the the list of columns in SCHOOLS table and their column type (datatype) and length.

In [5]:
%%sql

select COLUMN_NAME, DATA_TYPE
    from INFORMATION_SCHEMA.COLUMNS
    where TABLE_NAME = 'SCHOOLS';

 * mysql://root:***@localhost/ibm_sql_lab
78 rows affected.

[('10th Grade PLAN (2009)', 'text'),
 ('10th Grade PLAN (2010)', 'text'),
 ('11th Grade Average ACT (2011)', 'text'),
 ('9th Grade EXPLORE (2009)', 'text'),
 ('9th Grade EXPLORE (2010)', 'text'),
 ('Adequate Yearly Progress Made?', 'text'),
 ('Average Teacher Attendance', 'text'),
 ('AVERAGE_STUDENT_ATTENDANCE', 'text'),
 ('City', 'text'),
 ('Collaborative Name', 'text'),
 ('College Eligibility %', 'text'),
 ('College Enrollment Rate %', 'text'),
 ('COLLEGE_ENROLLMENT', 'int'),
 ('COMMUNITY_AREA_NAME', 'text'),
 ('COMMUNITY_AREA_NUMBER', 'int'),
 ('CPS Performance Policy Level', 'text'),
 ('CPS Performance Policy Status', 'text'),
 ('Elementary, Middle, or High School', 'text'),
 ('Environment Icon', 'text'),
 ('Environment Score', 'text'),
 ('Family Involvement Icon', 'text'),
 ('Family Involvement Score', 'text'),
 ('Freshman on Track Rate %', 'text'),
 ('General Services Route', 'int'),
 ('Gr-8 Explore Math %', 'text'),
 ('Gr-8 Explore Read %', 'text'),
 ('Gr3-5 Grade Level Math %', 'text'),
 ('Gr3-5 Grade Level Read %', 'text'),
 ('Gr3-5 Keep Pace Math %', 'text'),
 ('Gr3-5 Keep Pace Read %', 'text'),
 ('Gr6-8 Grade Level Math %', 'text'),
 ('Gr6-8 Grade Level Read %', 'text'),
 ('Gr6-8 Keep Pace Math%', 'text'),
 ('Gr6-8 Keep Pace Read %', 'text'),
 ('Graduation Rate %', 'text'),
 ('HEALTHY_SCHOOL_CERTIFIED', 'text'),
 ('Individualized Education Program Compliance Rate', 'text'),
 ('Instruction Icon', 'text'),
 ('Instruction Score', 'text'),
 ('ISAT Exceeding Math %', 'text'),
 ('ISAT Exceeding Reading %', 'text'),
 ('ISAT Value Add Color Math', 'text'),
 ('ISAT Value Add Color Read', 'text'),
 ('ISAT Value Add Math', 'text'),
 ('ISAT Value Add Read', 'text'),
 ('Latitude', 'double'),
 ('Leaders Icon', 'text'),
 ('Leaders Score', 'text'),
 ('Link', 'text'),
 ('Location', 'text'),
 ('Longitude', 'double'),
 ('NAME_OF_SCHOOL', 'text'),
 ('Net Change EXPLORE and PLAN', 'text'),
 ('Net Change PLAN and ACT', 'text'),
 ('Network Manager', 'text'),
 ('Parent Engagement Icon', 'text'),
 ('Parent Engagement Score', 'text'),
 ('Parent Environment Icon', 'text'),
 ('Parent Environment Score', 'text'),
 ('Phone Number', 'text'),
 ('Pk-2 Literacy %', 'text'),
 ('Pk-2 Math %', 'text'),
 ('Police District', 'int'),
 ('Rate of Misconducts (per 100 students)', 'double'),
 ('Safety Icon', 'text'),
 ('SAFETY_SCORE', 'text'),
 ('School ID', 'int'),
 ('State', 'text'),
 ('Street Address', 'text'),
 ('Students Passing  Algebra %', 'text'),
 ('Students Taking  Algebra %', 'text'),
 ('Teachers Icon', 'text'),
 ('Teachers Score', 'text'),
 ('Track Schedule', 'text'),
 ('Ward', 'int'),
 ('X_COORDINATE', 'double'),
 ('Y_COORDINATE', 'double'),
 ('ZIP Code', 'int')]

### Questions

1.  Is the column name for the "SCHOOL ID" attribute in upper or mixed case?
2.  What is the name of "Community Area Name" column in your table? Does it have spaces?
3.  Are there any columns in whose names the spaces and paranthesis (round brackets) have been replaced by the underscore character "\_"?

## Problems

### Problem 1

##### How many Elementary Schools are in the dataset?

In [6]:
%%sql

select count(*) as 'NUMBER_OF_ELEMENTARY_SCHOOLS'
    from SCHOOLS
    where `Elementary, Middle, or High School` = 'ES';

 * mysql://root:***@localhost/ibm_sql_lab
1 rows affected.

[(462,)]

### Problem 2

##### What is the highest Safety Score?

In [7]:
%%sql

select max(SAFETY_SCORE) as 'HIGHEST_SAFETY_SCORE'
    from SCHOOLS;

 * mysql://root:***@localhost/ibm_sql_lab
1 rows affected.

[('99',)]

### Problem 3

##### Which schools have highest Safety Score?

In [8]:
%%sql

select NAME_OF_SCHOOL, SAFETY_SCORE
    from SCHOOLS 
    where SAFETY_SCORE = (select max(SAFETY_SCORE)
                          from SCHOOLS);

 * mysql://root:***@localhost/ibm_sql_lab
19 rows affected.

[('Abraham Lincoln Elementary School', '99'),
 ('Alexander Graham Bell Elementary School', '99'),
 ('Annie Keller Elementary Gifted Magnet School', '99'),
 ('Augustus H Burley Elementary School', '99'),
 ('Edgar Allan Poe Elementary Classical School', '99'),
 ('Edgebrook Elementary School', '99'),
 ('Ellen Mitchell Elementary School', '99'),
 ('James E McDade Elementary Classical School', '99'),
 ('James G Blaine Elementary School', '99'),
 ('LaSalle Elementary Language Academy', '99'),
 ('Mary E Courtenay Elementary Language Arts Center', '99'),
 ('Northside College Preparatory High School', '99'),
 ('Northside Learning Center High School', '99'),
 ('Norwood Park Elementary School', '99'),
 ('Oriole Park Elementary School', '99'),
 ('Sauganash Elementary School', '99'),
 ('Stephen Decatur Classical Elementary School', '99'),
 ('Talman Elementary School', '99'),
 ('Wildwood Elementary School', '99')]

### Problem 4

##### What are the top 10 schools with the highest "Average Student Attendance"?

In [9]:
%%sql

select NAME_OF_SCHOOL, AVERAGE_STUDENT_ATTENDANCE
    from SCHOOLS 
    order by AVERAGE_STUDENT_ATTENDANCE desc
    limit 10;

 * mysql://root:***@localhost/ibm_sql_lab
10 rows affected.

[('John Charles Haines Elementary School', '98.40%'),
 ('James Ward Elementary School', '97.80%'),
 ('Orozco Fine Arts & Sciences Elementary School', '97.60%'),
 ('Edgar Allan Poe Elementary Classical School', '97.60%'),
 ('Rachel Carson Elementary School', '97.60%'),
 ('Annie Keller Elementary Gifted Magnet School', '97.50%'),
 ('Lenart Elementary Regional Gifted Center', '97.40%'),
 ('Andrew Jackson Elementary Language Academy', '97.40%'),
 ('Disney II Magnet School', '97.30%'),
 ('John H Vanderpoel Elementary Magnet School', '97.20%')]

### Problem 5

##### Retrieve the list of 5 Schools with the lowest Average Student Attendance sorted in ascending order based on attendance

In [10]:
%%sql

select NAME_OF_SCHOOL, AVERAGE_STUDENT_ATTENDANCE
    from SCHOOLS 
    order by AVERAGE_STUDENT_ATTENDANCE 
    limit 5;

 * mysql://root:***@localhost/ibm_sql_lab
5 rows affected.

[('Velma F Thomas Early Childhood Center', ''),
 ('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Dyett High School', '62.50%'),
 ('Wendell Phillips Academy High School', '63.00%')]

### Problem 6

##### Now remove the '%' sign from the above result set for Average Student Attendance column

In [11]:
%%sql

select NAME_OF_SCHOOL, replace(AVERAGE_STUDENT_ATTENDANCE, '%', '') as AVERAGE_STUDENT_ATTENDANCE
    from SCHOOLS 
    order by AVERAGE_STUDENT_ATTENDANCE
    limit 5;

 * mysql://root:***@localhost/ibm_sql_lab
5 rows affected.

[('Velma F Thomas Early Childhood Center', ''),
 ('Richard T Crane Technical Preparatory High School', '57.90'),
 ('Barbara Vick Early Childhood & Family Center', '60.90'),
 ('Dyett High School', '62.50'),
 ('Wendell Phillips Academy High School', '63.00')]

### Problem 7

##### Which Schools have Average Student Attendance lower than 70%?

In [12]:
%%sql

select NAME_OF_SCHOOL, AVERAGE_STUDENT_ATTENDANCE
    from SCHOOLS 
    where AVERAGE_STUDENT_ATTENDANCE < 70
    order by AVERAGE_STUDENT_ATTENDANCE desc

 * mysql://root:***@localhost/ibm_sql_lab
9 rows affected.

[('Roberto Clemente Community Academy High School', '69.60%'),
 ('Chicago Vocational Career Academy High School', '68.80%'),
 ('Manley Career Academy High School', '66.80%'),
 ('Orr Academy High School', '66.30%'),
 ('Wendell Phillips Academy High School', '63.00%'),
 ('Dyett High School', '62.50%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Velma F Thomas Early Childhood Center', '')]

**Problem 7 alternative solution: First use the CAST() function to cast it as a DECIMAL or DOUBLE, i.e:`CAST("Column_Name" as DOUBLE)` or `CAST("Column_Name" as DECIMAL)`.**

In [13]:
%%sql 

select NAME_OF_SCHOOL, AVERAGE_STUDENT_ATTENDANCE
    from SCHOOLS 
    where cast(replace(AVERAGE_STUDENT_ATTENDANCE, '%', '') as double) < 70
    order by AVERAGE_STUDENT_ATTENDANCE desc

 * mysql://root:***@localhost/ibm_sql_lab
9 rows affected.

[('Roberto Clemente Community Academy High School', '69.60%'),
 ('Chicago Vocational Career Academy High School', '68.80%'),
 ('Manley Career Academy High School', '66.80%'),
 ('Orr Academy High School', '66.30%'),
 ('Wendell Phillips Academy High School', '63.00%'),
 ('Dyett High School', '62.50%'),
 ('Barbara Vick Early Childhood & Family Center', '60.90%'),
 ('Richard T Crane Technical Preparatory High School', '57.90%'),
 ('Velma F Thomas Early Childhood Center', '')]

### Problem 8

##### Get the total College Enrollment for each Community Area

In [14]:
%%sql

select COMMUNITY_AREA_NAME, count(*) as OCCURRENCE, sum(COLLEGE_ENROLLMENT) as TOTAL_COLLEGE_ENROLLMENT
    from schools
    group by COMMUNITY_AREA_NAME
    order by TOTAL_COLLEGE_ENROLLMENT desc;

 * mysql://root:***@localhost/ibm_sql_lab
77 rows affected.

[('SOUTH LAWNDALE', 22, Decimal('14793')),
 ('BELMONT CRAGIN', 12, Decimal('14386')),
 ('AUSTIN', 23, Decimal('10933')),
 ('GAGE PARK', 10, Decimal('9915')),
 ('BRIGHTON PARK', 8, Decimal('9647')),
 ('WEST TOWN', 20, Decimal('9429')),
 ('HUMBOLDT PARK', 13, Decimal('8620')),
 ('WEST RIDGE', 9, Decimal('8197')),
 ('NEAR WEST SIDE', 16, Decimal('7975')),
 ('NEW CITY', 13, Decimal('7922')),
 ('IRVING PARK', 9, Decimal('7764')),
 ('NORTH CENTER', 7, Decimal('7541')),
 ('LOGAN SQUARE', 11, Decimal('7351')),
 ('LOWER WEST SIDE', 11, Decimal('7257')),
 ('CHICAGO LAWN', 7, Decimal('7086')),
 ('LAKE VIEW', 11, Decimal('7055')),
 ('ROSELAND', 13, Decimal('7020')),
 ('PORTAGE PARK', 7, Decimal('6954')),
 ('ALBANY PARK', 8, Decimal('6864')),
 ('ENGLEWOOD', 17, Decimal('6832')),
 ('ASHBURN', 8, Decimal('6483')),
 ('NORWOOD PARK', 8, Decimal('6469')),
 ('WEST ENGLEWOOD', 13, Decimal('5946')),
 ('LINCOLN PARK', 7, Decimal('5615')),
 ('EAST GARFIELD PARK', 13, Decimal('5337')),
 ('EAST SIDE', 5, Decimal('5305')),
 ('NORTH LAWNDALE', 16, Decimal('5146')),
 ('CHATHAM', 9, Decimal('5042')),
 ('ARCHER HEIGHTS', 2, Decimal('4823')),
 ('DOUGLAS', 11, Decimal('4670')),
 ('EDGEWATER', 6, Decimal('4600')),
 ('DUNNING', 6, Decimal('4568')),
 ('GARFIELD RIDGE', 5, Decimal('4552')),
 ('SOUTH SHORE', 9, Decimal('4543')),
 ('UPTOWN', 7, Decimal('4388')),
 ('KENWOOD', 7, Decimal('4287')),
 ('NORTH PARK', 5, Decimal('4210')),
 ('WEST LAWN', 4, Decimal('4207')),
 ('WOODLAWN', 8, Decimal('4206')),
 ('AUBURN GRESHAM', 10, Decimal('4175')),
 ('LINCOLN SQUARE', 5, Decimal('4132')),
 ('ROGERS PARK', 6, Decimal('4068')),
 ('GREATER GRAND CROSSING', 10, Decimal('4051')),
 ('SOUTH CHICAGO', 7, Decimal('4043')),
 ('WASHINGTON HEIGHTS', 9, Decimal('4006')),
 ('HERMOSA', 4, Decimal('3975')),
 ('WEST ELSDON', 3, Decimal('3700')),
 ('AVONDALE', 4, Decimal('3640')),
 ('NEAR NORTH SIDE', 7, Decimal('3362')),
 ('MORGAN PARK', 5, Decimal('3271')),
 ('WEST PULLMAN', 10, Decimal('3240')),
 ('BRIDGEPORT', 5, Decimal('3167')),
 ('GRAND BOULEVARD', 8, Decimal('2809')),
 ('WASHINGTON PARK', 5, Decimal('2648')),
 ('WEST GARFIELD PARK', 8, Decimal('2622')),
 ('MOUNT GREENWOOD', 4, Decimal('2091')),
 ('CLEARING', 4, Decimal('2085')),
 ('HYDE PARK', 4, Decimal('1930')),
 ('SOUTH DEERING', 4, Decimal('1859')),
 ('JEFFERSON PARK', 2, Decimal('1755')),
 ('BEVERLY', 4, Decimal('1636')),
 ('PULLMAN', 5, Decimal('1620')),
 ('CALUMET HEIGHTS', 6, Decimal('1568')),
 ('MCKINLEY PARK', 4, Decimal('1552')),
 ('RIVERDALE', 4, Decimal('1547')),
 ('AVALON PARK', 3, Decimal('1522')),
 ('ARMOUR SQUARE', 3, Decimal('1458')),
 ('FOREST GLEN', 3, Decimal('1431')),
 ('NEAR SOUTH SIDE', 3, Decimal('1378')),
 ('MONTCLARE', 1, Decimal('1317')),
 ('HEGEWISCH', 2, Decimal('963')),
 ('EDISON PARK', 2, Decimal('910')),
 ('LOOP', 1, Decimal('871')),
 ('OHARE', 1, Decimal('786')),
 ('BURNSIDE', 1, Decimal('549')),
 ('FULLER PARK', 2, Decimal('531')),
 ('OAKLAND', 1, Decimal('140'))]

### Problem 9

##### Get the 5 Community Areas with the least total College Enrollment  sorted in ascending order

In [15]:
%%sql

select COMMUNITY_AREA_NAME, count(*) as OCCURRENCE, sum(COLLEGE_ENROLLMENT) as TOTAL_COLLEGE_ENROLLMENT
    from schools
    group by COMMUNITY_AREA_NAME
    order by TOTAL_COLLEGE_ENROLLMENT asc
    limit 5;

 * mysql://root:***@localhost/ibm_sql_lab
5 rows affected.

[('OAKLAND', 1, Decimal('140')),
 ('FULLER PARK', 2, Decimal('531')),
 ('BURNSIDE', 1, Decimal('549')),
 ('OHARE', 1, Decimal('786')),
 ('LOOP', 1, Decimal('871'))]

### Problem 10

##### Get the hardship index for the community area which has College Enrollment of 4368

In [16]:
%%sql

select S.COMMUNITY_AREA_NAME, S.COLLEGE_ENROLLMENT, C.HARDSHIP_INDEX
    from SCHOOLS S, CHICAGO_SOCIOECONOMIC_DATA C
    where S.COMMUNITY_AREA_NAME = C.COMMUNITY_AREA_NAME
        and COLLEGE_ENROLLMENT = 4368

 * mysql://root:***@localhost/ibm_sql_lab
1 rows affected.

[('NORTH CENTER', 4368, 6.0)]

### Problem 11

##### Get the hardship index for the community area which has the highest value for College Enrollment

In [17]:
%%sql

select S.COMMUNITY_AREA_NAME, S.COLLEGE_ENROLLMENT, C.HARDSHIP_INDEX
    from SCHOOLS S, CHICAGO_SOCIOECONOMIC_DATA C
    where C.COMMUNITY_AREA_NAME = S.COMMUNITY_AREA_NAME
        and COLLEGE_ENROLLMENT = (select max(COLLEGE_ENROLLMENT)
                                  from SCHOOLS)

 * mysql://root:***@localhost/ibm_sql_lab
1 rows affected.

[('NORTH CENTER', 4368, 6.0)]

## Summary

##### In this lab you learned how to work with a real word dataset using SQL and Python. You learned how to query columns with spaces or special characters in their names and with mixed case names. You also used built in database functions and practiced how to sort, limit, and order result sets, as well as used sub-queries and worked with multiple tables.

## Author

[Temitope Adesusi](https://www.linkedin.com/in/ttadesusi)

## Reference

[IBM Data Science](https://www.coursera.org/professional-certificates/ibm-data-science?)

[Socioeconomic Indicators in Chicago](https://github.com/ttadesusi/IBM-Data-Science-Professional-Certification/blob/master/5.%20Databases%20and%20SQL%20for%20Data%20Science/MySQL_Database-Analyzing_with_Python.ipynb)